chgpalmer/nrf9151-tracker/apps/tracker/src/main.c
/* ── cell identity (AT%XMONITOR) ─────────────────────────────────  */
/* Helper: extract the next comma-delimited XMONITOR field, stripping the
 * surrounding quotes if present. Returns the token or NULL. Uses strtok state. */
static char *xmon_field(char *first)
{
	char *f = strtok(first, ",");

	if (f && f[0] == '"') {
		f++;
		char *e = strchr(f, '"');

		if (e) {
			*e = '\0';
		}
	}
	return f;
}

/* Read the serving cell from AT%XMONITOR (cached — no radio scan). Fills sc.
 * XMONITOR: <reg>,"<long>","<short>","<plmn>","<tac>",<AcT>,<band>,
 *           "<cell_id>",<phys_cell_id>,<EARFCN>,<rsrp>,<snr>,...
 * PLMN is "MCCMNC" (MCC=first 3 digits); TAC and cell-id are hex strings. */
static int read_serving_cell(struct serving_cell *sc)
{
	char at_resp[256];

	memset(sc, 0, sizeof(*sc));

	if (nrf_modem_at_cmd(at_resp, sizeof(at_resp), "AT%%XMONITOR") != 0) {
		return -EIO;
	}

	char *cp = strchr(at_resp, ':');

	if (!cp) {
		return -EINVAL;
	}
	cp++;

	xmon_field(cp);                    /* 1: reg status */
	char *longn = xmon_field(NULL);    /* 2: long name  */
	xmon_field(NULL);                  /* 3: short name */
	char *plmn = xmon_field(NULL);     /* 4: plmn "MCCMNC" */
	char *tac  = xmon_field(NULL);     /* 5: tac (hex)  */
	xmon_field(NULL);                  /* 6: AcT        */
	char *band = xmon_field(NULL);     /* 7: band       */
	char *cid  = xmon_field(NULL);     /* 8: cell id (hex) */
	xmon_field(NULL);                  /* 9: phys cell  */
	xmon_field(NULL);                  /* 10: EARFCN    */
	char *rsrp = strtok(NULL, ",\r\n");/* 11: rsrp idx  */

	if (!plmn || strlen(plmn) < 5 || !tac || !cid) {
		return -ENODATA;
	}

	/* Split PLMN: MCC = first 3 chars, MNC = the rest (2 or 3 digits). */
	char mcc_buf[4] = { plmn[0], plmn[1], plmn[2], '\0' };

	sc->mcc = atoi(mcc_buf);
	sc->mnc = atoi(plmn + 3);
	sc->tac = strtoul(tac, NULL, 16);
	sc->cid = strtoul(cid, NULL, 16);
	sc->band = band ? atoi(band) : 0;
	sc->rsrp_dbm = rsrp ? RSRP_IDX_TO_DBM(atoi(rsrp)) : 0;
	if (longn) {
		strncpy(sc->op, longn, sizeof(sc->op) - 1);
	}
	sc->valid = true;
	return 0;
}

/* ── status block ─────────────────────────────────────────────────  */
static void print_status(const struct nrf_modem_gnss_pvt_data_frame *p,
			 const struct loc_status *loc, int64_t uptime_ms)
{
	LOG_DBG("===== status @ %llds =====", (long long)(uptime_ms / 1000));

	/* LTE status: registration state + serving-cell details (same cached
	 * AT%XMONITOR read used for the cell-location fallback). */
	struct serving_cell sc;

	if (read_serving_cell(&sc) == 0 && sc.valid) {
		LOG_DBG("LTE:  %s | op %s | band %d | cell %u | RSRP %d dBm",
			lte_status_str(), sc.op, sc.band, sc.cid, sc.rsrp_dbm);
	} else {
		LOG_DBG("LTE:  %s", lte_status_str());
	}

	/* GNSS status */
	if (p->flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
		LOG_DBG("GNSS: FIX  %.6f, %.6f  alt %.1fm  acc %.1fm  sats %u/%u",
			p->latitude, p->longitude,
			(double)p->altitude, (double)p->accuracy,
			loc->used, loc->tracked);
	} else {
		LOG_DBG("GNSS: searching  flags 0x%02x", p->flags);
		/* These two mean different things and want different fixes:
		 *   DEADLINE_MISSED        no window at all since the last PVT — LTE
		 *                          is transmitting; only backing off LTE helps.
		 *   NOT_ENOUGH_WINDOW_TIME windows exist but are too short — the case
		 *                          nrf_modem_gnss_prio_mode_enable() is for.
		 *
		 * Both are CONDITIONS, not events: they persist for minutes during
		 * LTE/GNSS contention, and per-pass WRNs would flood the uplink
		 * (dozens of lines per episode). Log the edges — onset at WRN,
		 * clear at INF — and leave the per-pass view to the DBG flags line
		 * above. Same pattern as the gnss_blocked edge. */
		static bool no_window_prev, short_window_prev;
		bool no_window = p->flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED;
		bool short_window =
			p->flags & NRF_MODEM_GNSS_PVT_FLAG_NOT_ENOUGH_WINDOW_TIME;

		/* These edges diagnose LTE/GNSS contention during CONTINUOUS
		 * tracking. In periodic mode every uplink flush trivially chops
		 * the sleeping receiver — the overnight parked log was 137 WRNs
		 * of exactly that. Meaningless there; don't evaluate. */
		if (loc->gnss_mode != LOC_GNSS_CONTINUOUS) {
			no_window_prev = no_window;
			short_window_prev = short_window;
		} else {
			if (no_window != no_window_prev) {
				no_window_prev = no_window;
				if (no_window) {
					LOG_WRN("GNSS: no window since last PVT (LTE active)");
				} else {
					LOG_INF("GNSS: windows back");
				}
			}
			if (short_window != short_window_prev) {
				short_window_prev = short_window;
				if (short_window) {
					LOG_WRN("GNSS: windows too short (no PSM/eDRX?)");
				} else {
					LOG_INF("GNSS: window length ok");
				}
			}
		}
	}
	loc_fsm_log(loc, p);

	if (psm_active_s < 0) {
		LOG_DBG("LTE:  RRC %s | PSM not granted",
			rrc_connected ? "connected" : "idle");
	} else {
		LOG_DBG("LTE:  RRC %s | PSM TAU %ds active %ds",
			rrc_connected ? "connected" : "idle",
			psm_tau_s, psm_active_s);
	}

	/* PDN state next to socket state, so a "no socket" that is really
	 * "PDN not up yet" is obvious in the log. */
	LOG_DBG("net:  %s | pdn %s", coap_pub_ready() ? "ready" : "no socket",
		pdn_active ? "active" : "down");
}

#if defined(CONFIG_NRF_MODEM_LIB)
#include <modem/at_monitor.h>

/* SIM readiness timing: "%XSIM: 1" marks the UICC initialized. Whether it
 * lands at +5 s or +60 s decides if the boot-attach gap is the SIM applet
 * (nothing we can do) or the modem's search scheduling (tunable below). */
static void xsim_handler(const char *notif)
{
	char buf[32];

	strncpy(buf, notif, sizeof(buf) - 1);
	buf[sizeof(buf) - 1] = '\0';
	buf[strcspn(buf, "\r\n")] = '\0';
	LOG_INF("SIM: %s", buf);
}
AT_MONITOR(xsim_monitor, "%XSIM", xsim_handler);

/* Front-load search attempts when unregistered: the default scheduling let
 * the modem idle ~60 s between a failed +9 s boot light search and the full
 * search that then succeeded in 6 s (measured 2026-07-12). Retry at 5 s,
 * then 10/20/40, then loop every 60 s — worst case a handful of extra scans
 * per outage, each seconds long. Written to modem NVM; `fastsearch off`
 * clears back to modem defaults. */
static void fast_search_configure(void)
{
	struct lte_lc_periodic_search_cfg cfg = {
		.loop = true,
		.return_to_pattern = 0,
		.band_optimization = 1,
		.pattern_count = 1,
		.patterns = { {
			.type = LTE_LC_PERIODIC_SEARCH_PATTERN_TABLE,
			.table = { .val_1 = 5, .val_2 = 10, .val_3 = 20,
				   .val_4 = 40, .val_5 = 60 },
		} },
	};
	int err = lte_lc_periodic_search_set(&cfg);

	if (err) {
		LOG_WRN("LTE: fast search pattern rejected (%d)", err);
	} else {
		LOG_INF("LTE: fast search pattern set");
	}
}

#if defined(CONFIG_SHELL)
#include <zephyr/shell/shell.h>

static int cmd_fastsearch(const struct shell *sh, size_t argc, char **argv)
{
	if (argc == 2 && strcmp(argv[1], "off") == 0) {
		shell_print(sh, "clear: %d (reboot re-applies unless rebuilt)",
			    lte_lc_periodic_search_clear());
	} else if (argc == 2 && strcmp(argv[1], "on") == 0) {
		fast_search_configure();
		shell_print(sh, "set");
	}
	return 0;
}
SHELL_CMD_ARG_REGISTER(fastsearch, NULL,
		       "Aggressive out-of-coverage search pattern (on|off)",
		       cmd_fastsearch, 1, 1);
#endif
#endif /* CONFIG_NRF_MODEM_LIB */

/* ── attach-speed experiment: network-state checkpoint ────────────────────
 * The modem persists its network history (band, channel, PLMN — and GNSS
 * data) to its own NVM only on CFUN=0, which an abrupt dev reset never
 * performs — so every cold boot pays a full scan (measured ~90 s vs 32-39 s
 * warm). Once per boot, at the first parked entry (radio idle, nobody
 * waiting), cycle power-off -> normal: one extra re-attach at the quietest
 * possible moment buys the NEXT reset a warm start. `checkpoint off` on the
 * shell disables it at runtime. */
static bool checkpoint_enabled = IS_ENABLED(CONFIG_TRACKER_LTE_CHECKPOINT);
static bool checkpoint_done;

#if defined(CONFIG_SHELL)
#include <zephyr/shell/shell.h>

static int cmd_checkpoint(const struct shell *sh, size_t argc, char **argv)
{
	if (argc == 2) {
		checkpoint_enabled = (strcmp(argv[1], "on") == 0);
	}
	shell_print(sh, "checkpoint %s%s", checkpoint_enabled ? "on" : "off",
		    checkpoint_done ? " (already ran this boot)" : "");
	return 0;
}
SHELL_CMD_ARG_REGISTER(checkpoint, NULL,
		       "LTE network-state checkpoint (on|off)",
		       cmd_checkpoint, 1, 1);
#endif

/* A datagram left the device: pulse the TX LED, stamp the RRC-tail
 * measurement, and tell the FSM when the coarse position is on the map (it
 * holds the radio for GNSS until the boot cell report is out). */
static void on_uplink_sent(uint32_t kinds_mask)
{
	leds_tx_pulse();
	last_pub_ms = k_uptime_get();
	if (kinds_mask & UPLINK_KIND_CELL) {
		loc_fsm_note_cell_sent();
	}
}

/* ── main ─────────────────────────────────────────────────────────  */
int main(void)
{
	int err;

	LOG_INF("tracker starting");

